## Plan Result (Ithc - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/ithc.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/1c912dda-b651-c86b-3465-9a4449aa9df9" -> (known after apply)
      ~ name                                   = "1c912dda-b651-c86b-3465-9a4449aa9df9" -> (known after apply)
      ~ principal_id                           = "457aabff-86ec-49cc-9b77-6b7b59420356" -> "/groups/457aabff-86ec-49cc-9b77-6b7b59420356" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"Ithc - TerraformPlanApply","Vars":{}} -->